IDEA Open Model
ReinfBarByPolyline Properties
Compatible with IDEA StatiCa Beta 20.0
The ReinfBarByPolyline type exposes the following members.
Properties
Name | Description
BarDistance
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
BarShape
 Polyline representing shape of bar
Cover
 Cover of reinforcement
 (Inherited from ReinforcementGroup.)
CoverFromSetting
 Use cover from DetailModelSetting
 (Inherited from ReinforcementGroup.)
Diameter
 Diameter o reinforcement
 (Inherited from ReinforcementGroup.)
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 (Inherited from ReinforcementGroup.)
Distance
 Distance between reinforcement layers
EndsTypeBeg
 End type of the beginning of reinforcement bar
 (Inherited from ReinforcementGroup.)
EndsTypeEnd
 End type of the end of reinforcement bar
 (Inherited from ReinforcementGroup.)
Id
 Element Id
 (Inherited from OpenElementId.)
MasterComponent
 Master component of reinforcement
MasterPoint
 Master point of reinforcement
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
 (Inherited from ReinforcementGroup.)
NumOfLayers
 Number of layers
Position
 Offset between master point and first point of BarShape
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
Top
See Also
Reference
ReinfBarByPolyline Class
IdeaRS.OpenModel.Detail Namespace